Tekla.Structures.Solid.Loop
The Loop class represents a single loop in a face.

Tekla.Structures.Solid.Loop.#ctor(System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Instantiates a new loop.
VertexList: A list of vertexes that will be in the new loop.

Tekla.Structures.Solid.Loop.GetVertexEnumerator
Gets a new vertex enumerator.
Returns: A vertex enumerator to enumerate through the vertexes in the loop.